app/controllers/pages_controller.rb

INSERT INTO `pages` (`position`, `created_at`, `title`, `body`, `updated_at`, `tagline`) VALUES(1, '2010-04-04 05:33:11', 'Who We Are', 'Founded in 2007, Gray Whale uses quantitative methods to identify trading opportunities, both domestically and internationally, across various financial instruments including stocks, futures, currencies, and options.\r\n\r\nOur culture is one of disciplined risk taking and continuous incremental improvement.', '2010-04-04 05:33:11', 'Gray Whale is a proprietary trading firm located in Santa Barbara, California.')
---
  def create
    @page = Page.new(params[:page])
    respond_to do |format|
      if @page.save

SELECT * FROM `pages` ORDER BY position
---
  def index
    @pages = Page.all(:order => 'position')

UPDATE `pages` SET `updated_at` = '2010-04-11 22:47:48', `body` = '27 W Anapamu no.138\r\nSanta Barbara, CA 93101\r\n\r\n805-889-9988 \r\n\r\ntrameson@graywhalecapital.com\r\n\r\nmchallen@graywhalecapital.com' WHERE `id` = 5
---
  def update
    respond_to do |format|
      if @page.update_attributes(params[:page])

SELECT * FROM `pages` WHERE (`pages`.`id` = 5)
---
  def find_page
    @page = Page.find(params[:id]) if params[:id]